/**  Задача 1:
 * Дан массив:
 * @var { [1, '2', '3px', {a: 4}, 5, '', null, false, true] }
 * @return {array} вернуть отфильтрованный только по числам входный массив, в котором каждое число будет умножено на 2
*/ 

/** Задача 2:
 * Дан массив:
 * @var { [1, 4, 2, 7, 8, 12, 3, 2, 7, 8] } 
 * @return {number} вернуть максимальный элемент массива чисел (Math.max)
*/

/**  Задача 3:
 * Даны два массива:
 * @var { [1, 2, 3, 2, 0] }
 * @var { [5, 1, 2, 7, 3, 2] }
 * @return {array} вернуть массив-пересечение двух входных массивов ([1, 2, 2, 3], порядок неважен)
*/

/** Задача 4:
 * Дан массив:
 * @var { [1, 2, 3, 4, 5, 6, 7, 8, 9, 0] } 
 * @return {string} "(123) 456-7890"
 * The returned format must be correct in order to complete this challenge
 * Don't forget the space after the closing parentheses!
*/

/** Задача 5:
 * @var { [1, 4, 2, 7, 8, 12, 3, 2, 7, 8] } 
 * @return {array} вернуть исходный массив, в котором сначала идут все нечетные числа, потом четные 
*/

/** Задача 6: *
 * @var { [‘one’, ‘two’, ‘three’] } 
 * @return {object} вернуть структуру данных, которая реализует группировку исходного массива по длине строки 
*/
